content/emacs-config.org
#+TITLE: Emacs config in org mode
#+AUTHOR: Shriram Ashirgade
#+STARTUP: content  hidestars indent

* Package management
** Use [[https://melpa.org/#/][MELPA]] for package archive
Adding melpa package repository and initializint
#+begin_src emacs-lisp
  (require 'package)
  (add-to-list 'package-archives 
                 '("melpa" . "https://melpa.org/packages/") t)
  ;; Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`
  ;; and `package-pinned-packages`. Most users will not need or want to do this.
  ;;(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)
  (package-initialize)
#+end_src
Note that you'll need to run ~M-x package-refresh-contents~ or ~M-x package-list-packages~ to ensure that Emacs has fetched the MELPA package list before you can install packages with M-x package-install or similar. Following does that automatically
#+BEGIN_SRC emacs-lisp
  (unless package-archive-contents
    (package-refresh-contents))
#+END_SRC
** Make sure that ~use-package~ is loaded
This downloads ~use-package~ package if not installed.
#+begin_src emacs-lisp
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))
  (require 'use-package)
  (setq use-package-always-ensure t)
#+end_src
* Theme
** VSCode dark theme
 #+BEGIN_SRC emacs-lisp
 (use-package vscode-dark-plus-theme
   :ensure t
   :config
   (load-theme 'vscode-dark-plus t))
 #+END_SRC
** Zenburn theme
 #+BEGIN_SRC emacs-lisp :tangle no
 (add-to-list 'custom-theme-load-path "~/.emacs.d/themes/")
 (load-theme 'zenburn-theme t)
 #+END_SRC
** No background in terminal mode
   Do not use theme background in terminal mode
   So we can use classic terminal view
   #+BEGIN_SRC emacs-lisp
   ;; No background when in terminal mode (to use default terminal background )
   (defun on-after-init ()
     (unless (display-graphic-p (selected-frame))
       (set-face-background 'default "unspecified-bg" (selected-frame))))

   (add-hook 'window-setup-hook 'on-after-init)
   #+END_SRC
* Mode line
** Doom modeline
Description
#+BEGIN_SRC emacs-lisp
(use-package doom-modeline
  :ensure t
  :hook (after-init . doom-modeline-mode))
#+END_SRC
* Basic UX settings
** Startup screen
Startup do not include help page
#+BEGIN_SRC emacs-lisp
;; Disable the splash screen (to enable it agin, replace the t with 0)
(setq inhibit-splash-screen 0)
#+END_SRC
** Neo tree side buffer
Using neotree to show current dir (Don't know how to use dired)
First config command adds neotree to startup hook so that it loads on startup
Second config command adds multiline mode to neotree so that long file names are shown by textwrap
#+BEGIN_SRC emacs-lisp
(use-package neotree
   :ensure t
   :config
   (add-hook 'emacs-startup-hook 'neotree)
   (add-hook 'neotree-mode-hook 'visual-line-mode))
#+END_SRC
** Fancy icons in GUI
Display fancy icons when in gui 
#+BEGIN_SRC emacs-lisp
(when (display-graphic-p)
  (require 'all-the-icons))
#+END_SRC
** Transient mark mode
Don't know what it is
#+BEGIN_SRC emacs-lisp
(transient-mark-mode 1)
#+END_SRC
