emacs-config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs config in org mode</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs config in org mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org26bd14a">Package management</a>
<ul>
<li><a href="#org7e4807a">Use MELPA for package archive</a></li>
<li><a href="#org09d70d7">Make sure that <code>use-package</code> is loaded</a></li>
</ul>
</li>
<li><a href="#org34664aa">Theme</a>
<ul>
<li><a href="#orgea42e31">VSCode dark theme</a></li>
<li><a href="#orgf4eb26d">Zenburn theme</a></li>
<li><a href="#org61d807e">No background in terminal mode</a></li>
</ul>
</li>
<li><a href="#orgdd046ad">Mode line</a>
<ul>
<li><a href="#org0d6b7e7">Doom modeline</a></li>
</ul>
</li>
<li><a href="#orgbbdc601">Basic UX settings</a>
<ul>
<li><a href="#orgab72a83">Startup screen</a></li>
<li><a href="#org72e2d02">Neo tree side buffer</a></li>
<li><a href="#org292f711">Fancy icons in GUI</a></li>
<li><a href="#org5d1a4f8">Transient mark mode</a></li>
<li><a href="#org0d90e6f">Which key</a></li>
<li><a href="#orge2da2ba">Yes or no ==&gt;  y or n</a></li>
<li><a href="#org54f34c3">No saving backups. We don't need them :D</a></li>
<li><a href="#org8c5384e">Beacon mode</a></li>
<li><a href="#orge827bc9"><span class="todo TODO">TODO</span> Camel Case (Make it only for prog mode)</a></li>
<li><a href="#org6061177"><span class="todo TODO">TODO</span> Electric pairs</a></li>
<li><a href="#org028201e">Hungry delete</a></li>
<li><a href="#org222f238">Sudo edit</a></li>
<li><a href="#org0041173">Rainbo delimiters</a></li>
<li><a href="#org36e863c">Fancy killring</a></li>
<li><a href="#org12f09e3">Pretty characters mode</a></li>
<li><a href="#org7345e7f">Open maximised</a></li>
<li><a href="#org5f7b5b0">Escape to quit prompt</a></li>
<li><a href="#orge97d91a">No menu bar, tool bar, and scroll bar</a></li>
<li><a href="#org48d13df">CUA mode ( for copy paste )</a></li>
<li><a href="#orgd459bf8">Auto line number</a></li>
<li><a href="#orgcb0a21e">Move custom files outside <code>init.el</code></a></li>
<li><a href="#org1d5db3b">Text wrapping</a></li>
</ul>
</li>
<li><a href="#org07a1978">Org mode</a>
<ul>
<li><a href="#orgaa8bbef">Org bable</a></li>
<li><a href="#orgfb27853">Org todo-&gt;done log time stamp</a></li>
<li><a href="#orgf6f8ea2">Org Bullets</a></li>
<li><a href="#org46a596d">Elipsis</a></li>
<li><a href="#orgfb6e8e5">Leading stars and indentation</a></li>
<li><a href="#org9ae0ed7">Hide emphasis markers</a></li>
<li><a href="#orgc089892">Pretty symbols</a></li>
<li><a href="#orgafbbe41"><span class="todo TODO">TODO</span> Custom faces for different headline level</a></li>
<li><a href="#org7473511">Variable pitch mode ? Ye kya hai re bava?</a></li>
<li><a href="#org97f2946">Snippets</a></li>
<li><a href="#org8a1c7a4">Gen config</a>
<ul>
<li><a href="#orgdf8a575">Src edit window no split</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb06e44e">Moving around</a>
<ul>
<li><a href="#orga461fbe">Ido</a>
<ul>
<li><a href="#orgf165490">Verticle Ido</a></li>
</ul>
</li>
<li><a href="#org9f5d69e">Ibuffer</a></li>
<li><a href="#orgdbccfb6">Smex</a></li>
<li><a href="#orgc58adfe">Ace jump mode</a></li>
<li><a href="#org13bae26">Split window improvement</a></li>
<li><a href="#org240aa86">Swiper for search</a></li>
<li><a href="#org568095f">Ivy</a></li>
<li><a href="#org3be5c00">Counsel for minibuffer help (comes with ivy)</a>
<ul>
<li><a href="#orga2b667a"><span class="todo TODO">TODO</span> Remove initial <code>^</code> symbol when in <code>M-x</code> input</a></li>
<li><a href="#org01dc605"><span class="todo TODO">TODO</span> Helpful integration</a></li>
</ul>
</li>
<li><a href="#org3bfd55c">Ivy rich</a>
<ul>
<li><a href="#org5641f7a"><span class="todo TODO">TODO</span> Better formatting for <code>switch buffer</code> viwe.</a></li>
</ul>
</li>
<li><a href="#orgee22220">Helpful</a></li>
</ul>
</li>
<li><a href="#org5296b86">Others</a>
<ul>
<li><a href="#org2df025b">Rainbow</a></li>
</ul>
</li>
<li><a href="#org1593036">Custom functoins</a>
<ul>
<li><a href="#org725090f">Kill word improvement</a></li>
</ul>
</li>
<li><a href="#orge486d2e">To do someday <code>[0/9]</code></a>
<ul>
<li><a href="#org9756756"><span class="todo TODO">TODO</span> Autocomplete? Company?</a></li>
<li><a href="#org30f008f"><span class="todo TODO">TODO</span> Yasnippets</a></li>
<li><a href="#org682bf06"><span class="todo TODO">TODO</span> Ivy Swyper(done) and Counsel for minibuffer</a></li>
<li><a href="#org733f1b4"><span class="todo TODO">TODO</span> Startup dashboard something</a></li>
<li><a href="#orgb1a4244"><span class="todo TODO">TODO</span> Magit</a></li>
<li><a href="#orgd4b7a20"><span class="todo TODO">TODO</span> Git changes in side gutter/fringes</a></li>
<li><a href="#org9374f2f"><span class="todo TODO">TODO</span> Indentation highlight</a></li>
<li><a href="#org5eba440"><span class="todo TODO">TODO</span> </a></li>
</ul>
</li>
<li><a href="#orgb3fc013"><span class="todo TODO">TODO</span> Using noweb to better organize config</a></li>
<li><a href="#orga551f79">Apply changes</a></li>
</ul>
</div>
</div>

<div id="outline-container-org26bd14a" class="outline-2">
<h2 id="org26bd14a">Package management</h2>
<div class="outline-text-2" id="text-org26bd14a">
</div>
<div id="outline-container-org7e4807a" class="outline-3">
<h3 id="org7e4807a">Use <a href="https://melpa.org/#/">MELPA</a> for package archive</h3>
<div class="outline-text-3" id="text-org7e4807a">
<p>
Adding melpa package repository and initializint
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">package</span>)
(add-to-list 'package-archives 
               '(<span style="font-style: italic;">"melpa"</span> . <span style="font-style: italic;">"https://melpa.org/packages/"</span>) t)
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Comment/uncomment this line to enable MELPA Stable if desired.  See `package-archive-priorities`</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">and `package-pinned-packages`. Most users will not need or want to do this.</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">(add-to-list 'package-archives '("melpa-stable" . "https://stable.melpa.org/packages/") t)</span>
(package-initialize)
</pre>
</div>
<p>
Note that you'll need to run <code>M-x package-refresh-contents</code> or <code>M-x package-list-packages</code> to ensure that Emacs has fetched the MELPA package list before you can install packages with M-x package-install or similar. Following does that automatically
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">unless</span> package-archive-contents
  (package-refresh-contents))
</pre>
</div>
</div>
</div>
<div id="outline-container-org09d70d7" class="outline-3">
<h3 id="org09d70d7">Make sure that <code>use-package</code> is loaded</h3>
<div class="outline-text-3" id="text-org09d70d7">
<p>
This downloads <code>use-package</code> package if not installed.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">unless</span> (package-installed-p 'use-package)
  (package-install 'use-package))
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">use-package</span>)
(<span style="font-weight: bold;">setq</span> use-package-always-ensure t)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org34664aa" class="outline-2">
<h2 id="org34664aa">Theme</h2>
<div class="outline-text-2" id="text-org34664aa">
</div>
<div id="outline-container-orgea42e31" class="outline-3">
<h3 id="orgea42e31">VSCode dark theme</h3>
<div class="outline-text-3" id="text-orgea42e31">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package vscode-dark-plus-theme
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span>
  (load-theme 'vscode-dark-plus t))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf4eb26d" class="outline-3">
<h3 id="orgf4eb26d">Zenburn theme</h3>
<div class="outline-text-3" id="text-orgf4eb26d">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'custom-theme-load-path <span style="font-style: italic;">"~/.emacs.d/themes/"</span>)
(load-theme 'zenburn-theme t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org61d807e" class="outline-3">
<h3 id="org61d807e">No background in terminal mode</h3>
<div class="outline-text-3" id="text-org61d807e">
<p>
Do not use theme background in terminal mode
So we can use classic terminal view
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">No background when in terminal mode (to use default terminal background )</span>
(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">on-after-init</span> ()
  (<span style="font-weight: bold;">unless</span> (display-graphic-p (selected-frame))
    (set-face-background 'default <span style="font-style: italic;">"unspecified-bg"</span> (selected-frame))))

(add-hook 'window-setup-hook 'on-after-init)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdd046ad" class="outline-2">
<h2 id="orgdd046ad">Mode line</h2>
<div class="outline-text-2" id="text-orgdd046ad">
</div>
<div id="outline-container-org0d6b7e7" class="outline-3">
<h3 id="org0d6b7e7">Doom modeline</h3>
<div class="outline-text-3" id="text-org0d6b7e7">
<p>
Description
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package doom-modeline
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> (after-init . doom-modeline-mode))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgbbdc601" class="outline-2">
<h2 id="orgbbdc601">Basic UX settings</h2>
<div class="outline-text-2" id="text-orgbbdc601">
</div>
<div id="outline-container-orgab72a83" class="outline-3">
<h3 id="orgab72a83">Startup screen</h3>
<div class="outline-text-3" id="text-orgab72a83">
<p>
Startup do not include help page
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Disable the splash screen (to enable it agin, replace the t with 0)</span>
(<span style="font-weight: bold;">setq</span> inhibit-splash-screen 0)
</pre>
</div>
</div>
</div>
<div id="outline-container-org72e2d02" class="outline-3">
<h3 id="org72e2d02">Neo tree side buffer</h3>
<div class="outline-text-3" id="text-org72e2d02">
<p>
Using neotree to show current dir (Don't know how to use dired)
First config command adds neotree to startup hook so that it loads on startup
Second config command adds multiline mode to neotree so that long file names are shown by textwrap
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package neotree
   <span style="font-weight: bold;">:ensure</span> t
   <span style="font-weight: bold;">:config</span>
   (add-hook 'emacs-startup-hook 'neotree)
   (add-hook 'neotree-mode-hook 'visual-line-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org292f711" class="outline-3">
<h3 id="org292f711">Fancy icons in GUI</h3>
<div class="outline-text-3" id="text-org292f711">
<p>
Display fancy icons when in gui 
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">when</span> (display-graphic-p)
  (<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">all-the-icons</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5d1a4f8" class="outline-3">
<h3 id="org5d1a4f8">Transient mark mode</h3>
<div class="outline-text-3" id="text-org5d1a4f8">
<p>
Don't know what it is
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(transient-mark-mode 1)
</pre>
</div>
</div>
</div>
