content/emacs-config.org
** Which key
#+BEGIN_SRC emacs-lisp
  (use-package which-key
     :ensure t
     :init (which-key-mode)
     :config (setq which-key-idle-delay 0.7))
#+END_SRC
** Yes or no ==>  y or n
Instead of typing full *yes* or *no*, we just write *y* or *n*. Save some time for your girl.
#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC
** No saving backups. We don't need them :D
#+BEGIN_SRC emacs-lisp
  (setq make-backup-file nil)
  (setq auto-save-default nil)
#+END_SRC
** Beacon mode 
#+BEGIN_SRC emacs-lisp
  (use-package beacon
    :ensure t
    :init
    (beacon-mode 1))
#+END_SRC
** TODO Camel Case (Make it only for prog mode)
#+BEGIN_SRC emacs-lisp
  (global-subword-mode 1)
#+END_SRC
** TODO Electric pairs
Not working porperly
#+BEGIN_SRC emacs-lisp :tangle no
  (setq electric-pair-pairs '(
                              (?\ . ?\))
                              (?\[ . ?\])
                              (?\" . ?\")
                              ))
  (electric-pair-mode t)
#+END_SRC
** Hungry delete 
To remove all lagging spaces all at once
#+BEGIN_SRC emacs-lisp
  (use-package hungry-delete
    :ensure t
    :config (global-hungry-delete-mode))
#+END_SRC
** Sudo edit
Do I really need it?
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package sudo-edit
    :ensure t
    :bind ("s-e" . sudo-edit))
#+END_SRC
** Rainbo delimiters
Only for prog mode?
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :hook ((prog-mode . rainbow-delimiters-mode)
           (org-mode . rainbow-delimiters-mode)))
#+END_SRC
** Fancy killring
#+BEGIN_SRC emacs-lisp
  (use-package popup-kill-ring
    :ensure t
    :bind ("M-y" . popup-kill-ring))
#+END_SRC
** Pretty characters mode
#+BEGIN_SRC emacs-lisp
  (when window-system
    (use-package pretty-mode
      :ensure t
      :config (global-pretty-mode 1)))
#+END_SRC 
** Open maximised
#+BEGIN_SRC emacs-lisp
  (add-to-list 'initial-frame-alist '(fullscreen . maximized))
  (add-to-list 'default-frame-alist '(fullscreen . fullheight))
#+END_SRC
** Escape to quit prompt
Press ~ESC~ to quit the prompt
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+END_SRC
** No menu bar, tool bar, and scroll bar
Removing tool bar on top. Let's be honest, who uses it. ...
#+BEGIN_SRC emacs-lisp
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
#+END_SRC
** CUA mode ( for copy paste )
Usual C-c C-v for copy paste
#+BEGIN_SRC emacs-lisp
;;; Auto CUA mode
(cua-mode t)
(setq cua-auto-tabify-rectangles nil) ;; Don't tabify after rectangle commands
(transient-mark-mode 1) ;; No region when it is not highlighted
(setq cua-keep-region-after-copy t) ;; Standard Windows behaviour
#+END_SRC
** Auto line number
To always have line numbers on the side

#+BEGIN_SRC emacs-lisp
  (column-number-mode 1)
  (line-number-mode 1)
  (global-display-line-numbers-mode t)

  ;; Disable line numbers for some modes
  (dolist (mode '(term-mode-hook
                  eshell-mode-hook
                  neotree-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+END_SRC

Showing relative line numbers
#+BEGIN_SRC emacs-lisp :tangle no
(setq display-line-numbers-type 'relative)
#+END_SRC
** Move custom files outside ~init.el~
   Move all ~custom-*~ stuff into ~custom.config.el~. Do not put them in ~init.el~.

#+begin_src emacs-lisp
(setq custom-file "~/.emacs.d/custom.conf.el")
(load-file custom-file)
#+end_src
** Text wrapping
Turn on [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Visual-Line-Mode.html][visual-line-moe]] for text and org files. This wraps words by word boundaries.

#+begin_src emacs-lisp
(add-hook 'text-mode-hook 'visual-line-mode)
(add-hook 'org-mode 'visual-line-mode)
#+end_src
* Org mode
** Org bable
+ Org bable load languages
 #+BEGIN_SRC emacs-lisp
 (org-babel-do-load-languages
  'org-babel-load-languages
  '(
    (python . t)
    (shell . t)
    ))
 #+END_SRC

+  Org bable no confirmation for following languages
 #+BEGIN_SRC emacs-lisp
 (defun my-org-confirm-babel-evaluate (lang body)
   (not (member lang '("python" ))))
 (setq org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)
 #+END_SRC

+  Language specific commands
  -  Python command
     #+BEGIN_SRC emacs-lisp
     (setq org-babel-python-command "python3")
      #+END_SRC
** Org todo->done log time stamp
Log a timestamp when a TODO is changed to DONE state
#+BEGIN_SRC emacs-lisp
(setq org-log-done 'time)
#+END_SRC

And log it to a drawer
#+BEGIN_SRC emacs-lisp
  (setq org-log-into-drawer t)
#+END_SRC

