emacs-config.html
<div id="outline-container-org0d90e6f" class="outline-3">
<h3 id="org0d90e6f">Which key</h3>
<div class="outline-text-3" id="text-org0d90e6f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package which-key
   <span style="font-weight: bold;">:ensure</span> t
   <span style="font-weight: bold;">:init</span> (which-key-mode)
   <span style="font-weight: bold;">:config</span> (<span style="font-weight: bold;">setq</span> which-key-idle-delay 0.7))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge2da2ba" class="outline-3">
<h3 id="orge2da2ba">Yes or no ==&gt;  y or n</h3>
<div class="outline-text-3" id="text-orge2da2ba">
<p>
Instead of typing full <b>yes</b> or <b>no</b>, we just write <b>y</b> or <b>n</b>. Save some time for your girl.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defalias</span> '<span style="font-weight: bold;">yes-or-no-p</span> 'y-or-n-p)
</pre>
</div>
</div>
</div>
<div id="outline-container-org54f34c3" class="outline-3">
<h3 id="org54f34c3">No saving backups. We don't need them :D</h3>
<div class="outline-text-3" id="text-org54f34c3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> make-backup-file nil)
(<span style="font-weight: bold;">setq</span> auto-save-default nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-org8c5384e" class="outline-3">
<h3 id="org8c5384e">Beacon mode</h3>
<div class="outline-text-3" id="text-org8c5384e">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package beacon
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span>
  (beacon-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-orge827bc9" class="outline-3">
<h3 id="orge827bc9"><span class="todo TODO">TODO</span> Camel Case (Make it only for prog mode)</h3>
<div class="outline-text-3" id="text-orge827bc9">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-subword-mode 1)
</pre>
</div>
</div>
</div>
<div id="outline-container-org6061177" class="outline-3">
<h3 id="org6061177"><span class="todo TODO">TODO</span> Electric pairs</h3>
<div class="outline-text-3" id="text-org6061177">
<p>
Not working porperly
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> electric-pair-pairs '(
                            (?\ . ?\))
                            (?\[ . ?\])
                            (?\" . ?\")
                            ))
(electric-pair-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org028201e" class="outline-3">
<h3 id="org028201e">Hungry delete</h3>
<div class="outline-text-3" id="text-org028201e">
<p>
To remove all lagging spaces all at once
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package hungry-delete
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:config</span> (global-hungry-delete-mode))
</pre>
</div>
</div>
</div>
<div id="outline-container-org222f238" class="outline-3">
<h3 id="org222f238">Sudo edit</h3>
<div class="outline-text-3" id="text-org222f238">
<p>
Do I really need it?
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package sudo-edit
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"s-e"</span> . sudo-edit))
</pre>
</div>
</div>
</div>
<div id="outline-container-org0041173" class="outline-3">
<h3 id="org0041173">Rainbo delimiters</h3>
<div class="outline-text-3" id="text-org0041173">
<p>
Only for prog mode?
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rainbow-delimiters
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:hook</span> ((prog-mode . rainbow-delimiters-mode)
         (org-mode . rainbow-delimiters-mode)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org36e863c" class="outline-3">
<h3 id="org36e863c">Fancy killring</h3>
<div class="outline-text-3" id="text-org36e863c">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package popup-kill-ring
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"M-y"</span> . popup-kill-ring))
</pre>
</div>
</div>
</div>
<div id="outline-container-org12f09e3" class="outline-3">
<h3 id="org12f09e3">Pretty characters mode</h3>
<div class="outline-text-3" id="text-org12f09e3">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">when</span> window-system
  (use-package pretty-mode
    <span style="font-weight: bold;">:ensure</span> t
    <span style="font-weight: bold;">:config</span> (global-pretty-mode 1)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7345e7f" class="outline-3">
<h3 id="org7345e7f">Open maximised</h3>
<div class="outline-text-3" id="text-org7345e7f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'initial-frame-alist '(fullscreen . maximized))
(add-to-list 'default-frame-alist '(fullscreen . fullheight))
</pre>
</div>
</div>
</div>
<div id="outline-container-org5f7b5b0" class="outline-3">
<h3 id="org5f7b5b0">Escape to quit prompt</h3>
<div class="outline-text-3" id="text-org5f7b5b0">
<p>
Press <code>ESC</code> to quit the prompt
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="font-style: italic;">"&lt;escape&gt;"</span>) 'keyboard-escape-quit)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge97d91a" class="outline-3">
<h3 id="orge97d91a">No menu bar, tool bar, and scroll bar</h3>
<div class="outline-text-3" id="text-orge97d91a">
<p>
Removing tool bar on top. Let's be honest, who uses it. &#x2026;
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)
</pre>
</div>
</div>
</div>
<div id="outline-container-org48d13df" class="outline-3">
<h3 id="org48d13df">CUA mode ( for copy paste )</h3>
<div class="outline-text-3" id="text-org48d13df">
<p>
Usual C-c C-v for copy paste
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;;; </span><span style="font-weight: bold; font-style: italic;">Auto CUA mode</span>
(cua-mode t)
(<span style="font-weight: bold;">setq</span> cua-auto-tabify-rectangles nil) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Don't tabify after rectangle commands</span>
(transient-mark-mode 1) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">No region when it is not highlighted</span>
(<span style="font-weight: bold;">setq</span> cua-keep-region-after-copy t) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Standard Windows behaviour</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd459bf8" class="outline-3">
<h3 id="orgd459bf8">Auto line number</h3>
<div class="outline-text-3" id="text-orgd459bf8">
<p>
To always have line numbers on the side
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(column-number-mode 1)
(line-number-mode 1)
(global-display-line-numbers-mode t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Disable line numbers for some modes</span>
(<span style="font-weight: bold;">dolist</span> (mode '(term-mode-hook
                eshell-mode-hook
                neotree-mode-hook))
  (add-hook mode (<span style="font-weight: bold;">lambda</span> () (display-line-numbers-mode 0))))
</pre>
</div>

<p>
Showing relative line numbers
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> display-line-numbers-type 'relative)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcb0a21e" class="outline-3">
<h3 id="orgcb0a21e">Move custom files outside <code>init.el</code></h3>
<div class="outline-text-3" id="text-orgcb0a21e">
<p>
Move all <code>custom-*</code> stuff into <code>custom.config.el</code>. Do not put them in <code>init.el</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> custom-file <span style="font-style: italic;">"~/.emacs.d/custom.conf.el"</span>)
(load-file custom-file)
</pre>
</div>
</div>
</div>
<div id="outline-container-org1d5db3b" class="outline-3">
<h3 id="org1d5db3b">Text wrapping</h3>
<div class="outline-text-3" id="text-org1d5db3b">
<p>
Turn on <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Visual-Line-Mode.html">visual-line-moe</a> for text and org files. This wraps words by word boundaries.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'text-mode-hook 'visual-line-mode)
(add-hook 'org-mode 'visual-line-mode)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org07a1978" class="outline-2">
<h2 id="org07a1978">Org mode</h2>
<div class="outline-text-2" id="text-org07a1978">
</div>
<div id="outline-container-orgaa8bbef" class="outline-3">
<h3 id="orgaa8bbef">Org bable</h3>
<div class="outline-text-3" id="text-orgaa8bbef">
<ul class="org-ul">
<li><p>
Org bable load languages
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (python . t)
   (shell . t)
   ))
</pre>
</div></li>

<li><p>
Org bable no confirmation for following languages
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">my-org-confirm-babel-evaluate</span> (lang body)
  (not (member lang '(<span style="font-style: italic;">"python"</span> ))))
(<span style="font-weight: bold;">setq</span> org-confirm-babel-evaluate 'my-org-confirm-babel-evaluate)
</pre>
</div></li>

<li>Language specific commands
<ul class="org-ul">
<li><p>
Python command
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-babel-python-command <span style="font-style: italic;">"python3"</span>)
</pre>
</div></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgfb27853" class="outline-3">
<h3 id="orgfb27853">Org todo-&gt;done log time stamp</h3>
<div class="outline-text-3" id="text-orgfb27853">
<p>
Log a timestamp when a TODO is changed to DONE state
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-log-done 'time)
</pre>
</div>

<p>
And log it to a drawer
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-log-into-drawer t)
</pre>
</div>
</div>
</div>
