content/emacs-config.org
** Org Bullets
#+BEGIN_SRC emacs-lisp
  (use-package org-bullets
    :after org
    :hook (org-mode . org-bullets-mode))

  ; :custom (org-bullet-list '("" "" "" "" ))
  ;  :config
  ;  (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))
#+END_SRC
** Elipsis
The end of the heading character that will show that the heading is folded
#+BEGIN_SRC emacs-lisp
  (setq org-ellipsis " ⤵")
#+END_SRC
Other interesting characters are ▼, ↴, ⬎, ⤷, and ⋱ 
** Leading stars and indentation
#+BEGIN_SRC emacs-lisp
  (setq org-startup-indented t
        org-hide-leading-stars t)
#+END_SRC
** Hide emphasis markers
Hide the ~code~, /italics/ and *bold* _u+nderline_ =verbatim= +strike-through+
#+BEGIN_SRC emacs-lisp
  (setq org-hide-emphasis-markers t)
#+END_SRC 
** Pretty symbols
Show pretty symbols like \lambda instead of \ lambda
#+BEGIN_SRC emacs-lisp
  (setq org-pretty-entities t)
#+END_SRC
** TODO Custom faces for different headline level
These are having some issues with toto font size being too small so check it out
#+BEGIN_SRC emacs-lisp :tangle no
  (custom-theme-set-faces
       'user
      `(org-level-4 ((t ( :height 1.1   ))))
     `(org-level-3 ((t ( :height 1  ))))
    `(org-level-2 ((t ( :height 1.1   ))))
   `(org-level-1 ((t ( :height 1.25  ))))
   `(org-document-title ((t ( :height 1.5 :underline nil)))))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (dolist (face '((org-level-1 . 1.3)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :weight 'regular :height (cdr face)))

#+END_SRC
** Variable pitch mode ? Ye kya hai re bava?
#+BEGIN_SRC emacs-lisp
  ;(add-hook 'org-mode-hook 'variable-pitch-mode)
#+END_SRC
** Snippets
#+BEGIN_SRC emacs-lisp
  (add-to-list 'org-structure-template-alist
               '("el" "#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("py" "#+BEGIN_SRC python\n?\n#+END_SRC"))
  (add-to-list 'org-structure-template-alist
               '("sh" "#+BEGIN_SRC shell\n?\n#+END_SRC"))
#+END_SRC

Org tempo can also be used. 

** Gen config
*** Src edit window no split
Do not split while editing ~src~ with ~C-c '~
#+BEGIN_SRC emacs-lisp :tangle no
  (setq org-src-window-setup 'current-window)
#+END_SRC
* Moving around
** Ido
I do this and I do that
~C-x C-f~ for using IDO to find file
#+BEGIN_SRC emacs-lisp :tangle no
  (setq ido-enable-flex-matching nil)
  (setq ido-create-new-buffer 'always)
  (setq ido-everywhere t)
  (ido-mode 1)
#+END_SRC
For simply switching buffer
#+BEGIN_SRC emacs-lisp :tangle no
  (global-set-key (kbd "C-x b") 'ido-switch-buffer)
#+END_SRC
*** Verticle Ido
Seems nice. But this depends on Ido, so keep the Ido section
#+BEGIN_SRC emacs-lisp
  (use-package ido-vertical-mode
    :ensure t
    :init
    (ido-vertical-mode 1))
#+END_SRC
** Ibuffer
To enter Ibuffer (gives a bit detailed view) 
#+BEGIN_SRC emacs-lisp 
  (global-set-key (kbd "C-x C-b") 'ibuffer)
#+END_SRC
** Smex
For easy ~M-x~
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package smex
    :ensure t
    :init (smex-initialize)
    :bind
    ("M-x" . smex))
#+END_SRC
** Ace jump mode
To jump around buffer/windows
#+BEGIN_SRC emacs-lisp
  (use-package ace-jump-mode
    :ensure t
    :bind
    ("M-s" . 'ace-jump-char-mode)
    ("C-x o" . 'ace-window))
#+END_SRC
** Split window improvement
This change willnot just split window but also follow to the new window.
#+BEGIN_SRC emacs-lisp
  (defun split-and-follow-horizontally ()
    (interactive)
    (split-window-below)
    (balance-windows)
    (other-window 1))
  (global-set-key (kbd "C-x 2") 'split-and-follow-horizontally)

  (defun split-and-follow-vertically ()
    (interactive)
    (split-window-right)
    (balance-windows)
    (other-window 1))
  (global-set-key (kbd "C-x 3") 'split-and-follow-vertically)
#+END_SRC
** Swiper for search
#+BEGIN_SRC emacs-lisp
  (use-package swiper
    :ensure t
    :bind ("C-s" . swiper))
#+END_SRC
** Ivy
#+BEGIN_SRC emacs-lisp
  (use-package ivy
      :diminish
      :bind (("C-x b" . ivy-switch-buffer)
             :map ivy-minibuffer-map
             ("TAB" . ivy-alt-done)	
             ("C-l" . ivy-alt-done)
             ("C-j" . ivy-next-line)
             ("C-k" . ivy-previous-line)
             :map ivy-switch-buffer-map
             ("C-k" . ivy-previous-line)
             ("C-l" . ivy-done)
             ("C-d" . ivy-switch-buffer-kill)
             :map ivy-reverse-i-search-map
             ("C-k" . ivy-previous-line)
             ("C-d" . ivy-reverse-i-search-kill))

      :config
      (ivy-mode 1))
#+END_SRC
