emacs-config.html

<div id="outline-container-orgf6f8ea2" class="outline-3">
<h3 id="orgf6f8ea2">Org Bullets</h3>
<div class="outline-text-3" id="text-orgf6f8ea2">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package org-bullets
  <span style="font-weight: bold;">:after</span> org
  <span style="font-weight: bold;">:hook</span> (org-mode . org-bullets-mode))

<span style="font-weight: bold; font-style: italic;">; </span><span style="font-weight: bold; font-style: italic;">:custom (org-bullet-list '("" "" "" "" ))</span>
<span style="font-weight: bold; font-style: italic;">;  </span><span style="font-weight: bold; font-style: italic;">:config</span>
<span style="font-weight: bold; font-style: italic;">;  </span><span style="font-weight: bold; font-style: italic;">(add-hook 'org-mode-hook (lambda () (org-bullets-mode))))</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org46a596d" class="outline-3">
<h3 id="org46a596d">Elipsis</h3>
<div class="outline-text-3" id="text-org46a596d">
<p>
The end of the heading character that will show that the heading is folded
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-ellipsis <span style="font-style: italic;">" &#10549;"</span>)
</pre>
</div>
<p>
Other interesting characters are ▼, ↴, ⬎, ⤷, and ⋱ 
</p>
</div>
</div>
<div id="outline-container-orgfb6e8e5" class="outline-3">
<h3 id="orgfb6e8e5">Leading stars and indentation</h3>
<div class="outline-text-3" id="text-orgfb6e8e5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-startup-indented t
      org-hide-leading-stars t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org9ae0ed7" class="outline-3">
<h3 id="org9ae0ed7">Hide emphasis markers</h3>
<div class="outline-text-3" id="text-org9ae0ed7">
<p>
Hide the <code>code</code>, <i>italics</i> and <b>bold</b> <span class="underline">u+nderline</span> <code>verbatim</code> <del>strike-through</del>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-hide-emphasis-markers t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc089892" class="outline-3">
<h3 id="orgc089892">Pretty symbols</h3>
<div class="outline-text-3" id="text-orgc089892">
<p>
Show pretty symbols like &lambda; instead of \ lambda
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-pretty-entities t)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgafbbe41" class="outline-3">
<h3 id="orgafbbe41"><span class="todo TODO">TODO</span> Custom faces for different headline level</h3>
<div class="outline-text-3" id="text-orgafbbe41">
<p>
These are having some issues with toto font size being too small so check it out
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(custom-theme-set-faces
     'user
    `(org-level-4 ((t ( <span style="font-weight: bold;">:height</span> 1.1   ))))
   `(org-level-3 ((t ( <span style="font-weight: bold;">:height</span> 1  ))))
  `(org-level-2 ((t ( <span style="font-weight: bold;">:height</span> 1.1   ))))
 `(org-level-1 ((t ( <span style="font-weight: bold;">:height</span> 1.25  ))))
 `(org-document-title ((t ( <span style="font-weight: bold;">:height</span> 1.5 <span style="font-weight: bold;">:underline</span> nil)))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">dolist</span> (face '((org-level-1 . 1.3)
                (org-level-2 . 1.1)
                (org-level-3 . 1.05)
                (org-level-4 . 1.0)
                (org-level-5 . 1.1)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil <span style="font-weight: bold;">:weight</span> 'regular <span style="font-weight: bold;">:height</span> (cdr face)))

</pre>
</div>
</div>
</div>
<div id="outline-container-org7473511" class="outline-3">
<h3 id="org7473511">Variable pitch mode ? Ye kya hai re bava?</h3>
<div class="outline-text-3" id="text-org7473511">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="font-weight: bold; font-style: italic;">;</span><span style="font-weight: bold; font-style: italic;">(add-hook 'org-mode-hook 'variable-pitch-mode)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org97f2946" class="outline-3">
<h3 id="org97f2946">Snippets</h3>
<div class="outline-text-3" id="text-org97f2946">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-to-list 'org-structure-template-alist
             '(<span style="font-style: italic;">"el"</span> <span style="font-style: italic;">"#+BEGIN_SRC emacs-lisp\n?\n#+END_SRC"</span>))
(add-to-list 'org-structure-template-alist
             '(<span style="font-style: italic;">"py"</span> <span style="font-style: italic;">"#+BEGIN_SRC python\n?\n#+END_SRC"</span>))
(add-to-list 'org-structure-template-alist
             '(<span style="font-style: italic;">"sh"</span> <span style="font-style: italic;">"#+BEGIN_SRC shell\n?\n#+END_SRC"</span>))
</pre>
</div>

<p>
Org tempo can also be used. 
</p>
</div>
</div>

<div id="outline-container-org8a1c7a4" class="outline-3">
<h3 id="org8a1c7a4">Gen config</h3>
<div class="outline-text-3" id="text-org8a1c7a4">
</div>
<div id="outline-container-orgdf8a575" class="outline-4">
<h4 id="orgdf8a575">Src edit window no split</h4>
<div class="outline-text-4" id="text-orgdf8a575">
<p>
Do not split while editing <code>src</code> with <code>C-c '</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> org-src-window-setup 'current-window)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb06e44e" class="outline-2">
<h2 id="orgb06e44e">Moving around</h2>
<div class="outline-text-2" id="text-orgb06e44e">
</div>
<div id="outline-container-orga461fbe" class="outline-3">
<h3 id="orga461fbe">Ido</h3>
<div class="outline-text-3" id="text-orga461fbe">
<p>
I do this and I do that
<code>C-x C-f</code> for using IDO to find file
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> ido-enable-flex-matching nil)
(<span style="font-weight: bold;">setq</span> ido-create-new-buffer 'always)
(<span style="font-weight: bold;">setq</span> ido-everywhere t)
(ido-mode 1)
</pre>
</div>
<p>
For simply switching buffer
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="font-style: italic;">"C-x b"</span>) 'ido-switch-buffer)
</pre>
</div>
</div>
<div id="outline-container-orgf165490" class="outline-4">
<h4 id="orgf165490">Verticle Ido</h4>
<div class="outline-text-4" id="text-orgf165490">
<p>
Seems nice. But this depends on Ido, so keep the Ido section
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ido-vertical-mode
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span>
  (ido-vertical-mode 1))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9f5d69e" class="outline-3">
<h3 id="org9f5d69e">Ibuffer</h3>
<div class="outline-text-3" id="text-org9f5d69e">
<p>
To enter Ibuffer (gives a bit detailed view) 
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key (kbd <span style="font-style: italic;">"C-x C-b"</span>) 'ibuffer)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdbccfb6" class="outline-3">
<h3 id="orgdbccfb6">Smex</h3>
<div class="outline-text-3" id="text-orgdbccfb6">
<p>
For easy <code>M-x</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package smex
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span> (smex-initialize)
  <span style="font-weight: bold;">:bind</span>
  (<span style="font-style: italic;">"M-x"</span> . smex))
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc58adfe" class="outline-3">
<h3 id="orgc58adfe">Ace jump mode</h3>
<div class="outline-text-3" id="text-orgc58adfe">
<p>
To jump around buffer/windows
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ace-jump-mode
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:bind</span>
  (<span style="font-style: italic;">"M-s"</span> . 'ace-jump-char-mode)
  (<span style="font-style: italic;">"C-x o"</span> . 'ace-window))
</pre>
</div>
</div>
</div>
<div id="outline-container-org13bae26" class="outline-3">
<h3 id="org13bae26">Split window improvement</h3>
<div class="outline-text-3" id="text-org13bae26">
<p>
This change willnot just split window but also follow to the new window.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">split-and-follow-horizontally</span> ()
  (<span style="font-weight: bold;">interactive</span>)
  (split-window-below)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd <span style="font-style: italic;">"C-x 2"</span>) 'split-and-follow-horizontally)

(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">split-and-follow-vertically</span> ()
  (<span style="font-weight: bold;">interactive</span>)
  (split-window-right)
  (balance-windows)
  (other-window 1))
(global-set-key (kbd <span style="font-style: italic;">"C-x 3"</span>) 'split-and-follow-vertically)
</pre>
</div>
</div>
</div>
<div id="outline-container-org240aa86" class="outline-3">
<h3 id="org240aa86">Swiper for search</h3>
<div class="outline-text-3" id="text-org240aa86">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package swiper
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"C-s"</span> . swiper))
</pre>
</div>
</div>
</div>
