content/emacs-config.org
** Counsel for minibuffer help (comes with ivy)
#+BEGIN_SRC emacs-lisp 
  (use-package counsel
      :ensure t
      :bind (("M-x" . counsel-M-x)
             ("C-x f" . counsel-find-file)
             :map minibuffer-local-map
             ("C-r" . 'counsel-minibuffer-history))
      :config (setq ivy-initial-inputs-alist nil)
      )
#+END_SRC
*** TODO Remove initial ~^~ symbol when in ~M-x~ input 
*** TODO Helpful integration
** Ivy rich
Some helpful transformations for ~Ivy~ and ~Counsel~
#+BEGIN_SRC emacs-lisp
  (use-package ivy-rich
    :init
    (ivy-rich-mode 1)
    :config
    (setq ivy-format-function #'ivy-format-function-line))
#+END_SRC
*** TODO Better formatting for ~switch buffer~ viwe.
** Helpful
#+BEGIN_SRC emacs-lisp
  (use-package helpful
     :custom
     (counsel-describe-function-function #'helpful-callable)
     (counsel-describe-variable-function #'helpful-variable)
     :bind 
     ([remap describe-function] .  counsel-describe-function)
     ([remap describe-symbol]  . helpful-symbol)
     ([remap describe-variable] . counsel-describe-variable)
     ([remap describe-command] .  helpful-command)
     ([remap describe-key] .  helpful-key))
#+END_SRC
* Others
** Rainbow
For generative work
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package rainbow-mode
    :ensure t
    :init (add-hook prog-mode-hook 'rainbow-mode))
#+END_SRC
* Custom functoins
** Kill word improvement
#+BEGIN_SRC emacs-lisp
  (defun kill-whole-word ()
    (interactive)
    (backward-word)
    (kill-word 1))
  (global-set-key (kbd "M-d") 'kill-whole-word)	     
#+END_SRC
* To do someday [0/9]
** TODO Autocomplete? Company? 
** TODO Yasnippets
** TODO Ivy Swyper(done) and Counsel for minibuffer
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package ivy
    :diminish
    :bind (("C-x b" . ivy-switch-buffer)
           :map ivy-minibuffer-map
           ("TAB" . ivy-alt-done)	
           ("C-l" . ivy-alt-done)
           ("C-j" . ivy-next-line)
           ("C-k" . ivy-previous-line)
           :map ivy-switch-buffer-map
           ("C-k" . ivy-previous-line)
           ("C-l" . ivy-done)
           ("C-d" . ivy-switch-buffer-kill)
           :map ivy-reverse-i-search-map
           ("C-k" . ivy-previous-line)
           ("C-d" . ivy-reverse-i-search-kill))

    :config
    (ivy-mode 1))
#+END_SRC
#+BEGIN_SRC emacs-lisp :tangle no
  (use-package counsel
      :ensure t
      :bind ("M-x" . counsel-M-x))

      :config ((setq counsel-describe-function-function #'helpful-callable)
              (setq counsel-describe-variable-function #'helpful-variable)))
#+END_SRC
** TODO Startup dashboard something    
** TODO Magit
#+BEGIN_SRC emacs-lisp
  (use-package magit)
#+END_SRC
** TODO Git changes in side gutter/fringes
** TODO [[https://github.com/DarthFennec/highlight-indent-guides][Indentation highlight]]
** TODO
* TODO  Using noweb to better organize config
* Apply changes
Copy the file to the required location
Go to the code below and press ~C-c~ and then confirm yes
#+BEGIN_SRC shell :results none
  cp config.org ~/.emacs.d/config.org
#+END_SRC

And reload the emacs config
