emacs-config.html
<div id="outline-container-org568095f" class="outline-3">
<h3 id="org568095f">Ivy</h3>
<div class="outline-text-3" id="text-org568095f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ivy
    <span style="font-weight: bold;">:diminish</span>
    <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-x b"</span> . ivy-switch-buffer)
           <span style="font-weight: bold;">:map</span> ivy-minibuffer-map
           (<span style="font-style: italic;">"TAB"</span> . ivy-alt-done)       
           (<span style="font-style: italic;">"C-l"</span> . ivy-alt-done)
           (<span style="font-style: italic;">"C-j"</span> . ivy-next-line)
           (<span style="font-style: italic;">"C-k"</span> . ivy-previous-line)
           <span style="font-weight: bold;">:map</span> ivy-switch-buffer-map
           (<span style="font-style: italic;">"C-k"</span> . ivy-previous-line)
           (<span style="font-style: italic;">"C-l"</span> . ivy-done)
           (<span style="font-style: italic;">"C-d"</span> . ivy-switch-buffer-kill)
           <span style="font-weight: bold;">:map</span> ivy-reverse-i-search-map
           (<span style="font-style: italic;">"C-k"</span> . ivy-previous-line)
           (<span style="font-style: italic;">"C-d"</span> . ivy-reverse-i-search-kill))

    <span style="font-weight: bold;">:config</span>
    (ivy-mode 1))
</pre>
</div>
</div>
</div>
<div id="outline-container-org3be5c00" class="outline-3">
<h3 id="org3be5c00">Counsel for minibuffer help (comes with ivy)</h3>
<div class="outline-text-3" id="text-org3be5c00">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package counsel
    <span style="font-weight: bold;">:ensure</span> t
    <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"M-x"</span> . counsel-M-x)
           (<span style="font-style: italic;">"C-x f"</span> . counsel-find-file)
           <span style="font-weight: bold;">:map</span> minibuffer-local-map
           (<span style="font-style: italic;">"C-r"</span> . 'counsel-minibuffer-history))
    <span style="font-weight: bold;">:config</span> (<span style="font-weight: bold;">setq</span> ivy-initial-inputs-alist nil)
    )
</pre>
</div>
</div>
<div id="outline-container-orga2b667a" class="outline-4">
<h4 id="orga2b667a"><span class="todo TODO">TODO</span> Remove initial <code>^</code> symbol when in <code>M-x</code> input</h4>
</div>
<div id="outline-container-org01dc605" class="outline-4">
<h4 id="org01dc605"><span class="todo TODO">TODO</span> Helpful integration</h4>
</div>
</div>
<div id="outline-container-org3bfd55c" class="outline-3">
<h3 id="org3bfd55c">Ivy rich</h3>
<div class="outline-text-3" id="text-org3bfd55c">
<p>
Some helpful transformations for <code>Ivy</code> and <code>Counsel</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ivy-rich
  <span style="font-weight: bold;">:init</span>
  (ivy-rich-mode 1)
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> ivy-format-function #'ivy-format-function-line))
</pre>
</div>
</div>
<div id="outline-container-org5641f7a" class="outline-4">
<h4 id="org5641f7a"><span class="todo TODO">TODO</span> Better formatting for <code>switch buffer</code> viwe.</h4>
</div>
</div>
<div id="outline-container-orgee22220" class="outline-3">
<h3 id="orgee22220">Helpful</h3>
<div class="outline-text-3" id="text-orgee22220">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package helpful
   <span style="font-weight: bold;">:custom</span>
   (counsel-describe-function-function #'helpful-callable)
   (counsel-describe-variable-function #'helpful-variable)
   <span style="font-weight: bold;">:bind</span> 
   ([remap describe-function] .  counsel-describe-function)
   ([remap describe-symbol]  . helpful-symbol)
   ([remap describe-variable] . counsel-describe-variable)
   ([remap describe-command] .  helpful-command)
   ([remap describe-key] .  helpful-key))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5296b86" class="outline-2">
<h2 id="org5296b86">Others</h2>
<div class="outline-text-2" id="text-org5296b86">
</div>
<div id="outline-container-org2df025b" class="outline-3">
<h3 id="org2df025b">Rainbow</h3>
<div class="outline-text-3" id="text-org2df025b">
<p>
For generative work
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package rainbow-mode
  <span style="font-weight: bold;">:ensure</span> t
  <span style="font-weight: bold;">:init</span> (add-hook prog-mode-hook 'rainbow-mode))
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1593036" class="outline-2">
<h2 id="org1593036">Custom functoins</h2>
<div class="outline-text-2" id="text-org1593036">
</div>
<div id="outline-container-org725090f" class="outline-3">
<h3 id="org725090f">Kill word improvement</h3>
<div class="outline-text-3" id="text-org725090f">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">defun</span> <span style="font-weight: bold;">kill-whole-word</span> ()
  (<span style="font-weight: bold;">interactive</span>)
  (backward-word)
  (kill-word 1))
(global-set-key (kbd <span style="font-style: italic;">"M-d"</span>) 'kill-whole-word)        
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge486d2e" class="outline-2">
<h2 id="orge486d2e">To do someday <code>[0/9]</code></h2>
<div class="outline-text-2" id="text-orge486d2e">
</div>
<div id="outline-container-org9756756" class="outline-3">
<h3 id="org9756756"><span class="todo TODO">TODO</span> Autocomplete? Company?</h3>
</div>
<div id="outline-container-org30f008f" class="outline-3">
<h3 id="org30f008f"><span class="todo TODO">TODO</span> Yasnippets</h3>
</div>
<div id="outline-container-org682bf06" class="outline-3">
<h3 id="org682bf06"><span class="todo TODO">TODO</span> Ivy Swyper(done) and Counsel for minibuffer</h3>
<div class="outline-text-3" id="text-org682bf06">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package ivy
  <span style="font-weight: bold;">:diminish</span>
  <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-x b"</span> . ivy-switch-buffer)
         <span style="font-weight: bold;">:map</span> ivy-minibuffer-map
         (<span style="font-style: italic;">"TAB"</span> . ivy-alt-done) 
         (<span style="font-style: italic;">"C-l"</span> . ivy-alt-done)
         (<span style="font-style: italic;">"C-j"</span> . ivy-next-line)
         (<span style="font-style: italic;">"C-k"</span> . ivy-previous-line)
         <span style="font-weight: bold;">:map</span> ivy-switch-buffer-map
         (<span style="font-style: italic;">"C-k"</span> . ivy-previous-line)
         (<span style="font-style: italic;">"C-l"</span> . ivy-done)
         (<span style="font-style: italic;">"C-d"</span> . ivy-switch-buffer-kill)
         <span style="font-weight: bold;">:map</span> ivy-reverse-i-search-map
         (<span style="font-style: italic;">"C-k"</span> . ivy-previous-line)
         (<span style="font-style: italic;">"C-d"</span> . ivy-reverse-i-search-kill))

  <span style="font-weight: bold;">:config</span>
  (ivy-mode 1))
</pre>
</div>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package counsel
    <span style="font-weight: bold;">:ensure</span> t
    <span style="font-weight: bold;">:bind</span> (<span style="font-style: italic;">"M-x"</span> . counsel-M-x))

    <span style="font-weight: bold;">:config</span> ((<span style="font-weight: bold;">setq</span> counsel-describe-function-function #'helpful-callable)
            (<span style="font-weight: bold;">setq</span> counsel-describe-variable-function #'helpful-variable)))
</pre>
</div>
</div>
</div>
<div id="outline-container-org733f1b4" class="outline-3">
<h3 id="org733f1b4"><span class="todo TODO">TODO</span> Startup dashboard something</h3>
</div>
<div id="outline-container-orgb1a4244" class="outline-3">
<h3 id="orgb1a4244"><span class="todo TODO">TODO</span> Magit</h3>
<div class="outline-text-3" id="text-orgb1a4244">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(use-package magit)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd4b7a20" class="outline-3">
<h3 id="orgd4b7a20"><span class="todo TODO">TODO</span> Git changes in side gutter/fringes</h3>
</div>
<div id="outline-container-org9374f2f" class="outline-3">
<h3 id="org9374f2f"><span class="todo TODO">TODO</span> <a href="https://github.com/DarthFennec/highlight-indent-guides">Indentation highlight</a></h3>
</div>
<div id="outline-container-org5eba440" class="outline-3">
<h3 id="org5eba440"><span class="todo TODO">TODO</span> </h3>
</div>
</div>
<div id="outline-container-orgb3fc013" class="outline-2">
<h2 id="orgb3fc013"><span class="todo TODO">TODO</span> Using noweb to better organize config</h2>
</div>
<div id="outline-container-orga551f79" class="outline-2">
<h2 id="orga551f79">Apply changes</h2>
<div class="outline-text-2" id="text-orga551f79">
<p>
Copy the file to the required location
Go to the code below and press <code>C-c</code> and then confirm yes
</p>
<div class="org-src-container">
<pre class="src src-shell">cp config.org ~/.emacs.d/config.org
</pre>
</div>

<p>
And reload the emacs config
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9)</p>
<p class="validation"></p>
</div>
</body>
</html>
